<?php
return [
  'Аватар' => 'Аватар',
  'Фото' => 'Фото',
  'Email' => 'Email',
  'Телефон' => 'Телефон',
  'Ключ авторизации' => 'Ключ авторизації',
  'Хеш пароля' => 'Хеш пароля',
  'Токен сброса пароля' => 'Токен скидання пароля',
  'Место положения' => 'Місце знаходження',
  'Статус' => 'Статус',
  'Дата создания' => 'Дата створення',
  'Дата последнего обновления' => 'Дата останнього оновлення',
  'Новый пароль' => 'Новий пароль',
  'Контактное лицо' => 'Контактная особа',
  'Это фото слишком большое. Максимальный размер: 300kb.' => 'Це фото занадто велике. Максимальний розмір: 300kb.',
  'Не правильный формат фото. Разрешенные форматы: jpg, jpeg, png, gif.' => 'Не правильний формат фото. Дозволені формати: jpg, jpeg, png, gif.',
  'Пароли не совпадают' => 'Паролі не співпадають',
];