<?php
return [
  'Публиковать объявления могут только авторизованные пользователи.' => 'Публікувати оголошення можуть тільки авторизовані користувачі.',

  'Подать обьявление - шаг 1' => 'Подати оголошення - крок 1',

  'Подать обьявление - шаг 2' => 'Подати оголошення - крок 2',
  'Запустите рекламу, что бы получить больше кликов' => 'Запустіть рекламу, щоб отримати більше переглядів',
  'Не рекламировать' => 'Не рекламувати',
  'Оплатить' => 'Сплатити',
  'Всего к оплате' => 'Всього до сплати',
  'Выбрать' => 'Обрати',
  'Выбрано' => 'Обрано',

  'Спасибо за публикацию обьявления.' => 'Дякуємо за публікацію оголошення.',
  'Ваше объявление будет опубликовано сразу же после модерации!' => 'Ваше оголошення буде опубліковано відразу після модерації!',
  'Вернуться на главную' => 'Повернутися на головну',

  'Заголовок' => 'Заголовок',
  'Рубрика' => 'Рубрика',
  'Текст объявления' => 'Текст оголошення',
  'Фото' => 'Фото',
  'Ваши контакты' => 'Ваші контакти',
  'Страна' => 'Країна',
  'Украина' => 'Україна',
  'Область' => 'Область',
  'Город' => 'Місто',
  'Email' => 'Email',
  'Контактное лицо' => 'Контактная особа',
  'Далее' => 'Далі',
  '' => '',
];